In [1]:
%pwd

'C:\\Users\\Baron\\Desktop\\EE_257_Repo\\EE_257\\%ML_PATH_EE257%\\EE257_env\\Assignments'

In [7]:
import pandas as pd 
dataset = pd.read_excel("problem3_dataset.xlsx") # allows us to read the data in the file
#dataset = pd.BLANK("EE257_GapMinder.csv")      # same fucntion but for csv format


dataset.head(100)

   Year  Cheese Consumption  Degrees Awarded
0  2000                 9.3              480
1  2001                 9.7              501
2  2002                 9.7              540
3  2003                 9.7              552
4  2004                 9.9              547
5  2005                10.2              622
6  2006                10.5              655
7  2007                11.0              701
8  2008                10.6              712
9  2009                10.6              708

In [10]:
dataset.describe()

             Year  Cheese Consumption  Degrees Awarded
count    10.00000           10.000000        10.000000
mean   2004.50000           10.120000       601.800000
std       3.02765            0.541192        88.693981
min    2000.00000            9.300000       480.000000
25%    2002.25000            9.700000       541.750000
50%    2004.50000           10.050000       587.000000
75%    2006.75000           10.575000       689.500000
max    2009.00000           11.000000       712.000000

In [11]:
corr_matrix = dataset.corr(numeric_only = 1)
corr_matrix

                       Year  Cheese Consumption  Degrees Awarded
Year                1.00000            0.922230         0.976080
Cheese Consumption  0.92223            1.000000         0.958648
Degrees Awarded     0.97608            0.958648         1.000000